CRNBuilder-edited/data/HM1_bluff-body_flame/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //                                     
                                        
convertToMeters 0.001;                  
                                        
vertices                                
(
    (0.0 0 0.0) //0
    (1.798286798847344 0 0.0785148972576048) //1
    (24.976205539546445 0 1.0904846841334) //2
    (89.9143399423672 0 3.92574486288024) //3
    (89.9143399423672 360 3.92574486288024) //4
    (24.976205539546445 360 1.0904846841334) //5
    (1.798286798847344 360 0.0785148972576048) //6
    (0.0 360 0.0) //7
    (1.798286798847344 0 -0.0785148972576048) //8
    (24.976205539546445 0 -1.0904846841334) //9
    (89.9143399423672 0 -3.92574486288024) //10
    (89.9143399423672 360 -3.92574486288024) //11
    (24.976205539546445 360 -1.0904846841334) //12
    (1.798286798847344 360 -0.0785148972576048) //13
);

blocks
(
	hex (0  1  8  0  7  6 13  7)    (10   1 300)    simpleGrading  (1   1  3)  // Fuel inlet
	hex (1  2  9  8  6  5 12 13)    (110  1 300)    simpleGrading  (1.5 1  3)  // Bluff body
	hex (2  3 10  9  5  4 11 12)    (170  1 300)    simpleGrading  (2   1  3)  // Air inlet
);
                                     
edges                                
(                                    
);                                   
                                     
patches                              
(                                    
    patch fuelinlet                  
    (                                
        (0 1 8 0)                    
    )                                
                                     
    patch airinlet                   
    (                                
        (2 3 10 9)
    )                                
                       
    patch outlet                     
    (
	    (7 6 13 7)
	    (6 5 12 13)
	    (5 4 11 12)
    )                                
                                     
    empty axis                       
    (
        (0 7 7 0)
    )                                
    
                                 
    wall leftside
    (                                    
        (3 10 11 4)
    )
                                     
    wall bluffbody                  
    (
        (1 2 9 8)
    )                                
                                     
    wedge front                      
    (
        (0 1 6 7)
        (1 2 5 6)
        (2 3 4 5)
    )                                
                                     
    wedge back                       
    (
        (0 8 13 7)
        (8 9 12 13)
        (9 10 11 12)
    )                             
                                     
);                                   
                                     
mergePatchPairs                      
(                                    
);                                   
				    
