CRNBuilder-edited/data/HM1_bluff-body_flame/case/constant/SparkModel
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SparkModel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

spark 		on;
position    	(4.5e-3  0.0 1.5e-3);
time		0.;
temperature 	2200.;
duration 	0.01;
diameter 	1.5e-3;

